[
  {
    "title": "English Phrases Lesson 1",
    "id": "0lzg9NnWt30",
    "subtitle": "\"to keep count\" and \"to lose count\"",
    "video_url": "https://www.youtube-nocookie.com/embed/0lzg9NnWt30?controls=0",
    "video_time": 237,
    "description": "In this English lesson, I wanted to help you learn the English phrase \"to keep count\". This simply means to count something while you're doing it. When I put flowers in a bucket for Jen, sometimes Jen says, \"Put 100 flowers in each bucket.\" So as I do it, I need to keep count. I put in one flower and then two flowers and three. And as I do it in my mind, I try to keep track. I try to keep count of the number of flowers that I put in so that I don't put in too many. Because if I put 105 flowers in a bucket and Jen sells it, then we gave three, or sorry, five flowers away for free, I'm having trouble doing math today. So when you keep count, it simply means to count something while you're doing it."
  },
  {
    "title": "English Phrases Lesson 2",
    "id": "PUgaaFxwJoU",
    "subtitle": "\"to die for\" and \"to die of boredom\"",
    "video_url": "https://www.youtube-nocookie.com/embed/PUgaaFxwJoU?controls=0",
    "video_time": 238,
    "description": "In this English lesson, I wanted to help you learn the English phrase, to die for. When you describe something as being to die for, it just means it's really, really good. I know it has the word die in it, which is a sad word, but if you were to go to a restaurant and order a chocolate dessert and it was amazing, you might tell your friend, \"You need to order the chocolate dessert, it is to die for.\" It just means that it's really, really good, it's like the best chocolate dessert you've ever had in your life, it's to die for."
  },
  {
    "title": "English Phrases Lesson 3",
    "id": "nUbf7vQRLtk",
    "subtitle": "\"as far as I can see\" and \"to see something through\"",
    "video_url": "https://www.youtube-nocookie.com/embed/nUbf7vQRLtk?controls=0",
    "video_time": 238,
    "description": "In this English lesson, I wanted to help you learn the English phrase \"as far as I can see.\" Now this doesn't have anything to do with seeing a long ways. It has nothing to do with me being able to see something that's far away. It basically means \"as I understand something.\" So I could say this. As far as I can see, YouTube is a good way to learn English. As far as I can see, learning how to do something can only help make you a better person. So basically as I understand it, as far as I can see, those things are a good idea. So I guess I'm trying to think of another way to explain this. Like my understanding of the situation lets me say that I think this is a good idea. So as far as I can see, hiring someone to help you speak English once a week for 30 minutes? As far as I can see, that's a good idea. It has no drawbacks in my mind."
  },
  {
    "title": "English Phrases Lesson 4",
    "id": "U6LOpPmYKhI",
    "subtitle": "\"a close call\" and \"to call off\"",
    "video_url": "https://www.youtube-nocookie.com/embed/U6LOpPmYKhI?controls=0",
    "video_time": 162,
    "description": "In this English lesson I wanted to help you learn the English phrase, \"a close call.\" When something is a close call, it means that something bad almost happened, but it didn't happen. Here's a little story. Once when I was younger, I was working, I was about 17. I was working on a building on scaffolding. You know, what they put along the side of the building? And lightning struck the ground about a kilometer from where I was. But me and my coworkers saw little bolts of static electricity go from the scaffolding to the building. So we quickly climbed down and ran inside. That was a close call. I didn't get hit by lightning but it was certainly a close call. I was happy that the lightning hit far away."
  },
  {
    "title": "English Phrases Lesson 5",
    "id": "RR6-9GMAmgA",
    "subtitle": "\"a split second\" and \"to split up\"",
    "video_url": "https://www.youtube-nocookie.com/embed/RR6-9GMAmgA?controls=0",
    "video_time": 241,
    "description": "In this English lesson I wanted to help you learn the English phrase a split second. When something happens in a split second, it means it happens in less than a second. It happens instantly. It takes hardly any time at all. The other night I had to hit my brakes in a split second because a deer ran out on the road in front of me. That happens sometimes in this part of Canada, so I hit my brakes in a split second. My foot went from the floor of the van to the brake pedal in a split second. It went immediately like no time passed at all. It was definitely less than a second. I don't usually move that fast, but in situations like that, you need to react in a split second."
  }
]
